OpenDTEF-v1812/tutorials/compressible/rhoCentralFoam/biconic25-55Run35/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");

interpolationScheme cellPointFace;

setFormat       raw;

sets
(
    cone25
    {
        type    face;
        axis    x;
        start   (0 0 0);
        end     (0.09208087 0.042939 0);
        nPoints 92;
    }
    cone55
    {
        type    face;
        axis    x;
        start   (0.09208087 0.042939 0);
        end     (0.153683 0.13092 0);
        nPoints 61;
    }
    base
    {
        type    face;
        axis    x;
        start   (0.153683 0.13092 0);
        end     (0.193675 0.13092 0);
        nPoints 40;
    }
);

fields          ( p wallHeatTransRate );


// ************************************************************************* //
